<template>
  <section class="contacts">
    <div class="contacts__container">
      <h1 class="contacts__title">Ссылки на мои соц сети</h1>
      <p class="contacts__subtitle">
        Чтобы сделать заказ напишите мне в мессенджер, онлайн чаще всего бываю в
        телеграме. Пишите буду рад сотрудничеству
      </p>
      <p class="contacts__subtitle">
        Будет здорово, если вы сразу опишите такие детали проекта как: тематика
        сайта, необходимый функционал, пожелания по дизайну, если есть
        техническое задание, то и его прикрепляйте), если технического задания
        нет, то составим его совместно, контент для наполнения сайта (тексты,
        фото, видео), примеры понравившихся сайтов (не обязательно конкуретнов,
        всё адаптируемо), есть ли домен и хостинг
      </p>
      <div class="contacts__links">
        <a href="mailto:xolluej@list.ru" target="_blank" class="contacts__link">
          <svg
            width="38"
            height="38"
            viewBox="0 0 38 38"
            fill="#fff"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M19 0C8.50659 0 0 8.50659 0 19C0 29.4934 8.50659 38 19 38C29.4934 38 38 29.4934 38 19C38 8.50659 29.4934 0 19 0ZM7.91667 18.9686C7.91667 12.8745 12.8885 7.91667 18.9998 7.91667C25.1112 7.91667 30.0831 12.8745 30.0831 18.9686C30.0831 19.8319 30.011 20.5307 29.8496 21.2323L29.8472 21.2439C29.8468 21.246 29.7667 21.5693 29.7225 21.7104C29.4486 22.584 28.9527 23.3116 28.2882 23.8145C27.6439 24.3023 26.845 24.571 26.0387 24.571C25.9391 24.571 25.8388 24.567 25.7406 24.5591C24.5956 24.4675 23.5889 23.8667 22.9717 22.9087C21.9099 23.9732 20.5013 24.5589 18.9998 24.5589C15.9086 24.5589 13.3938 22.0511 13.3938 18.9686C13.3938 15.8861 15.9086 13.3783 18.9998 13.3783C22.091 13.3783 24.6059 15.8861 24.6059 18.9686V20.7706C24.6106 21.8221 25.3182 22.2519 25.9227 22.3006C26.5241 22.3468 27.3245 21.9975 27.6033 20.8573C27.7409 20.232 27.8108 19.5964 27.8108 18.9686C27.8108 14.1239 23.8582 10.1825 18.9998 10.1825C14.1415 10.1825 10.189 14.1239 10.189 18.9686C10.189 23.8132 14.1415 27.7547 18.9998 27.7547C20.691 27.7547 22.3358 27.273 23.7563 26.3618L23.7817 26.3454L25.2748 28.0764L25.2428 28.0983C23.3976 29.3559 21.2388 30.0206 18.9998 30.0206C12.8885 30.0206 7.91667 25.0627 7.91667 18.9686Z"
            />
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M22.3336 18.9685C22.3336 20.8016 20.838 22.293 18.9998 22.293C17.1615 22.293 15.666 20.8016 15.666 18.9685C15.666 17.1355 17.1615 15.6442 18.9998 15.6442C20.838 15.6442 22.3336 17.1355 22.3336 18.9685"
            />
          </svg>
          xolluej@list.ru</a
        >
        <a
          href="mailto:xolluej@gmail.com"
          target="_blank"
          class="contacts__link"
        >
          <svg
            width="38"
            height="38"
            viewBox="0 0 38 38"
            fill="#fff"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M19 0C8.50659 0 0 8.50659 0 19C0 29.4934 8.50659 38 19 38C29.4934 38 38 29.4934 38 19C38 8.50659 29.4934 0 19 0ZM7.91667 18.9686C7.91667 12.8745 12.8885 7.91667 18.9998 7.91667C25.1112 7.91667 30.0831 12.8745 30.0831 18.9686C30.0831 19.8319 30.011 20.5307 29.8496 21.2323L29.8472 21.2439C29.8468 21.246 29.7667 21.5693 29.7225 21.7104C29.4486 22.584 28.9527 23.3116 28.2882 23.8145C27.6439 24.3023 26.845 24.571 26.0387 24.571C25.9391 24.571 25.8388 24.567 25.7406 24.5591C24.5956 24.4675 23.5889 23.8667 22.9717 22.9087C21.9099 23.9732 20.5013 24.5589 18.9998 24.5589C15.9086 24.5589 13.3938 22.0511 13.3938 18.9686C13.3938 15.8861 15.9086 13.3783 18.9998 13.3783C22.091 13.3783 24.6059 15.8861 24.6059 18.9686V20.7706C24.6106 21.8221 25.3182 22.2519 25.9227 22.3006C26.5241 22.3468 27.3245 21.9975 27.6033 20.8573C27.7409 20.232 27.8108 19.5964 27.8108 18.9686C27.8108 14.1239 23.8582 10.1825 18.9998 10.1825C14.1415 10.1825 10.189 14.1239 10.189 18.9686C10.189 23.8132 14.1415 27.7547 18.9998 27.7547C20.691 27.7547 22.3358 27.273 23.7563 26.3618L23.7817 26.3454L25.2748 28.0764L25.2428 28.0983C23.3976 29.3559 21.2388 30.0206 18.9998 30.0206C12.8885 30.0206 7.91667 25.0627 7.91667 18.9686Z"
            />
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M22.3336 18.9685C22.3336 20.8016 20.838 22.293 18.9998 22.293C17.1615 22.293 15.666 20.8016 15.666 18.9685C15.666 17.1355 17.1615 15.6442 18.9998 15.6442C20.838 15.6442 22.3336 17.1355 22.3336 18.9685"
            />
          </svg>
          xolluej@gmail.com</a
        >
        <a
          href="https://t.me/AndrewDeveloper"
          target="_blank"
          class="contacts__link"
        >
          <svg
            width="38"
            height="38"
            viewBox="0 0 38 38"
            fill="#fff"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M38 19C38 29.4934 29.4934 38 19 38C8.50659 38 0 29.4934 0 19C0 8.50659 8.50659 0 19 0C29.4934 0 38 8.50659 38 19ZM12.7232 17.2596C10.8199 18.0906 8.86427 18.9444 7.07604 19.9294L7.07591 19.9296C6.14215 20.6132 7.38331 21.0968 8.5476 21.5504C8.73269 21.6225 8.91585 21.6938 9.08801 21.7651C9.23128 21.8091 9.37698 21.8556 9.52461 21.9026C10.8195 22.3151 12.2634 22.7752 13.5206 22.0832C15.5857 20.8969 17.5345 19.5254 19.4819 18.1549C20.1199 17.7059 20.7578 17.257 21.3995 16.8148C21.4296 16.7955 21.4635 16.7735 21.5006 16.7495C22.0473 16.3951 23.2768 15.5982 22.822 16.6963C21.7466 17.8724 20.5947 18.9135 19.4365 19.9603C18.6559 20.6658 17.8725 21.3738 17.1078 22.1275C16.4417 22.6687 15.7501 23.757 16.4959 24.5148C18.2137 25.7174 19.9584 26.8908 21.7021 28.0636C22.2695 28.4452 22.8368 28.8268 23.403 29.2092C24.3627 29.9754 25.8625 29.3557 26.0735 28.1584C26.1673 27.6076 26.2615 27.0569 26.3557 26.5061C26.8763 23.4624 27.3971 20.4177 27.8571 17.364C27.9196 16.885 27.9905 16.4061 28.0614 15.9269C28.2333 14.7654 28.4054 13.6025 28.4591 12.4348C28.3206 11.2695 26.9077 11.5257 26.1213 11.7878C22.0797 13.3256 18.0785 14.9775 14.0931 16.6586C13.6416 16.8586 13.1839 17.0584 12.7232 17.2596Z"
            />
          </svg>
          @AndrewDeveloper</a
        >
      </div>
    </div>
    <div class="contacts__image">
      <img src="@/assets/media/img/contacts-bg.png" alt="" />
    </div>
  </section>
</template>
<script>
// import {  } from "gsap";

export default {
  name: "contacts",
};
</script>
<style lang="scss">
.contacts {
  color: $white;
  display: flex;
  justify-content: space-between;
  align-items: center;
  width: 100%;
  &__container {
    padding-left: 60px;
    max-width: 680px;
    font-size: 16px;
  }
  &__image {
  }
  &__title {
    font-size: 48px;
    letter-spacing: 0.035em;
    margin-bottom: 30px;
  }
  &__subtitle {
    margin-bottom: 20px;
    line-height: 130%;

    &:last-child {
      margin-bottom: 0;
    }
  }
  &__links {
    margin-top: 80px;
    display: flex;
    justify-content: space-between;
  }
  &__link {
    display: flex;
    flex-direction: column;
    align-items: center;
    svg {
      margin-bottom: 15px;
    }
  }
}
</style>
